[{"id_doc": "site_docs_0000", "text": "# Древнейшие стихосложения мира: от шумеров к грекам\n\n**Проект выполняется при поддержке Российского научного фонда (грант № 18-18-00503).**\n\n+ Руководитель проекта – доктор филологических наук, профессор А.В. Сидельцев. \n\n+ Организация, выполняющая проект – федеральное государственное бюджетное учреждение науки Институт языкознания Российской академии наук.\n\nРазработка единых принципов разметки для языков с неизвестной системой стихосложения, начало анализа количества ударений, слогов, количества и расположения долгих гласных и тяжелых фонетических кластеров в строке, типов окончаний, наличия рифмы и схемы рифмовки в шумерском (*поэмы о Гильгамеше*), аккадском (*«Эпос о Гильгамеше»*), хеттском языках (*«Песнь об Улликумми»*).\n \nДанные по стиху во всех случаях контролируются сравнительными подсчетами по прозе, поэтому будет обработан по всем перечисленным параметрам сравнительный прозаический материал по каждому из языков (не менее 500 строк по стиху и не менее 500 прозаических предложений по прозе по каждому из исследуемых языков). \n\nОпределение метра и ритмических форм в греческой лирике, особенно в тех ее типах, где метр сформирован не до конца (с более свободно организованными первыми двумя слогами), то есть в текстах, предположительно являющихся позднейшей записью самых ранних из дошедших до нас стихотворных текстов. \n\nРазработка  структуры баз данных, в которых будут представлены результаты. Разработка программного обеспечения для соответствующих без данных,  которые на третьем году гранта будут сделаны доступными online для российских и западных исследователей.\n\n\n", "pdf": null}, {"id_doc": "site_docs_0001", "text": "# Сайт проекта: информационная система для поддержки научных исследований по древнему стихоложению.\n\nТо, с чем вы сейчас имеете дело, объявлено как **прототип сайта проекта**. Он не является интерфейсом для полнофункциональной информационной системы. Это экспериментальная разработка, поддерживающая лишь некоторые функции, причем на весьма небольшом объеме данных. \n\nПрограммный код сайта еще предстоит доделывать, а, возможно, и переделывать. В данном тексте будет рассказано как о том, каким должен быть этот сайт, так и о том, что уже можно посмотреть.\n\nПрежде всего расскажем о том, каким мы бы хотели видеть сайт проекта с точки зрения его содержимого и функциональных возможностей. \n\n## TO DO\n\nСайт проекта должен предоставлять пользователям web-интерфейс к информационной системе, содержащей сведения по древнейшим стихоложениям мира, включая как первоисточники, так и различные научные публикации по данной тематике. \n\nГлавная функция этой системы - организация информационного поиска, включая достаточно сложный полнотекстовый поиск на нескольких европейских языках, с учетом и без учета диакритики, поиск текстов на древних языках, поиск вхождений формализованной разметки и т.п.\n\nПервоначально планировалось использовать для представления информации реляционную базу данных, работающую под управлением стандартного SQL-сервера, например PostgeSQL. Даже была разработана схема данных для такой базы. Но от этой идеи пришлось отказаться по нескольким причинам.\n\n+ Во-первых, документы, которые предполагалось разместить были слишком разнородны. Достаточно адекватно представить их структуру без чрезмерного усложнения схемы данных было проблематично.\n\n+ Во-вторых, организовать систему полнотекстового поиска с помощью реляционной базы можно, но это связано с преодолением существенных технических трудностей. \n\n+ Руководитель проекта – доктор филологических наук, профессор А.В. Сидельцев. \n\n+ Организация, выполняющая проект – федеральное государственное бюджетное учреждение науки Институт языкознания Российской академии наук.\n\nРазработка единых принципов разметки для языков с неизвестной системой стихосложения, начало анализа количества ударений, слогов, количества и расположения долгих гласных и тяжелых фонетических кластеров в строке, типов окончаний, наличия рифмы и схемы рифмовки в шумерском (*поэмы о Гильгамеше*), аккадском (*«Эпос о Гильгамеше»*), хеттском языках (*«Песнь об Улликумми»*).\n \nДанные по стиху во всех случаях контролируются сравнительными подсчетами по прозе, поэтому будет обработан по всем перечисленным параметрам сравнительный прозаический материал по каждому из языков (не менее 500 строк по стиху и не менее 500 прозаических предложений по прозе по каждому из исследуемых языков). \n\nОпределение метра и ритмических форм в греческой лирике, особенно в тех ее типах, где метр сформирован не до конца (с более свободно организованными первыми двумя слогами), то есть в текстах, предположительно являющихся позднейшей записью самых ранних из дошедших до нас стихотворных текстов. \n\nРазработка  структуры баз данных, в которых будут представлены результаты. Разработка программного обеспечения для соответствующих без данных,  которые на третьем году гранта будут сделаны доступными online для российских и западных исследователей.\n\n\n", "pdf": null}]